---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.Insert(Autodesk.Revit.DB.Parameter)
source: html/fc38060a-ddfd-690d-6896-036df335cf40.htm
---
# Autodesk.Revit.DB.ParameterSet.Insert Method

Insert the specified parameter into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	Parameter item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Parameter`) - The parameter to be inserted into the set.

## Returns
Returns whether the parameter was inserted into the set.